GreatCowBASIC/DATFileGenerator/incfiles/p18f27q84.inc
;----- SLRCONC Bits -----------------------------------------------------
SLRC0            EQU  H'0000'
SLRC1            EQU  H'0001'
SLRC2            EQU  H'0002'
SLRC3            EQU  H'0003'
SLRC4            EQU  H'0004'
SLRC5            EQU  H'0005'
SLRC6            EQU  H'0006'
SLRC7            EQU  H'0007'


;----- INLVLC Bits -----------------------------------------------------
INLVLC0          EQU  H'0000'
INLVLC1          EQU  H'0001'
INLVLC2          EQU  H'0002'
INLVLC3          EQU  H'0003'
INLVLC4          EQU  H'0004'
INLVLC5          EQU  H'0005'
INLVLC6          EQU  H'0006'
INLVLC7          EQU  H'0007'


;----- IOCCP Bits -----------------------------------------------------
IOCCP0           EQU  H'0000'
IOCCP1           EQU  H'0001'
IOCCP2           EQU  H'0002'
IOCCP3           EQU  H'0003'
IOCCP4           EQU  H'0004'
IOCCP5           EQU  H'0005'
IOCCP6           EQU  H'0006'
IOCCP7           EQU  H'0007'


;----- IOCCN Bits -----------------------------------------------------
IOCCN0           EQU  H'0000'
IOCCN1           EQU  H'0001'
IOCCN2           EQU  H'0002'
IOCCN3           EQU  H'0003'
IOCCN4           EQU  H'0004'
IOCCN5           EQU  H'0005'
IOCCN6           EQU  H'0006'
IOCCN7           EQU  H'0007'


;----- IOCCF Bits -----------------------------------------------------
IOCCF0           EQU  H'0000'
IOCCF1           EQU  H'0001'
IOCCF2           EQU  H'0002'
IOCCF3           EQU  H'0003'
IOCCF4           EQU  H'0004'
IOCCF5           EQU  H'0005'
IOCCF6           EQU  H'0006'
IOCCF7           EQU  H'0007'


;----- WPUE Bits -----------------------------------------------------
WPUE3            EQU  H'0003'


;----- INLVLE Bits -----------------------------------------------------
INLVLE3          EQU  H'0003'


;----- IOCEP Bits -----------------------------------------------------
IOCEP3           EQU  H'0003'


;----- IOCEN Bits -----------------------------------------------------
IOCEN3           EQU  H'0003'


;----- IOCEF Bits -----------------------------------------------------
IOCEF3           EQU  H'0003'


;----- NCO2ACC Bits -----------------------------------------------------
NCO2ACC0         EQU  H'0000'
NCO2ACC1         EQU  H'0001'
NCO2ACC2         EQU  H'0002'
NCO2ACC3         EQU  H'0003'
NCO2ACC4         EQU  H'0004'
NCO2ACC5         EQU  H'0005'
NCO2ACC6         EQU  H'0006'
NCO2ACC7         EQU  H'0007'
ACC0             EQU  H'0000'
ACC1             EQU  H'0001'
ACC2             EQU  H'0002'
ACC3             EQU  H'0003'
ACC4             EQU  H'0004'
ACC5             EQU  H'0005'
ACC6             EQU  H'0006'
ACC7             EQU  H'0007'


;----- NCO2ACCH Bits -----------------------------------------------------
NCO2ACC8         EQU  H'0000'
NCO2ACC9         EQU  H'0001'
NCO2ACC10        EQU  H'0002'
NCO2ACC11        EQU  H'0003'
NCO2ACC12        EQU  H'0004'
NCO2ACC13        EQU  H'0005'
NCO2ACC14        EQU  H'0006'
NCO2ACC15        EQU  H'0007'
ACC8             EQU  H'0000'
ACC9             EQU  H'0001'
ACC10            EQU  H'0002'
ACC11            EQU  H'0003'
ACC12            EQU  H'0004'
ACC13            EQU  H'0005'
ACC14            EQU  H'0006'
ACC15            EQU  H'0007'


;----- NCO2ACCU Bits -----------------------------------------------------
ACC0             EQU  H'0000'
ACC1             EQU  H'0001'
ACC2             EQU  H'0002'
ACC3             EQU  H'0003'
NCO2ACC16        EQU  H'0000'
NCO2ACC17        EQU  H'0001'
NCO2ACC18        EQU  H'0002'
NCO2ACC19        EQU  H'0003'
ACC16            EQU  H'0000'
ACC17            EQU  H'0001'
ACC18            EQU  H'0002'
ACC19            EQU  H'0003'
NCO2ACC0         EQU  H'0000'
NCO2ACC1         EQU  H'0001'
NCO2ACC2         EQU  H'0002'
NCO2ACC3         EQU  H'0003'


;----- NCO2INC Bits -----------------------------------------------------
NCO2INC0         EQU  H'0000'
NCO2INC1         EQU  H'0001'
NCO2INC2         EQU  H'0002'
NCO2INC3         EQU  H'0003'
NCO2INC4         EQU  H'0004'
NCO2INC5         EQU  H'0005'
NCO2INC6         EQU  H'0006'
NCO2INC7         EQU  H'0007'
INC0             EQU  H'0000'
INC1             EQU  H'0001'
INC2             EQU  H'0002'
INC3             EQU  H'0003'
INC4             EQU  H'0004'
INC5             EQU  H'0005'
INC6             EQU  H'0006'
INC7             EQU  H'0007'


;----- NCO2INCH Bits -----------------------------------------------------
NCO2INC8         EQU  H'0000'
NCO2INC9         EQU  H'0001'
NCO2INC10        EQU  H'0002'
NCO2INC11        EQU  H'0003'
NCO2INC12        EQU  H'0004'
NCO2INC13        EQU  H'0005'
NCO2INC14        EQU  H'0006'
NCO2INC15        EQU  H'0007'
INC8             EQU  H'0000'
INC9             EQU  H'0001'
INC10            EQU  H'0002'
INC11            EQU  H'0003'
INC12            EQU  H'0004'
INC13            EQU  H'0005'
INC14            EQU  H'0006'
INC15            EQU  H'0007'


;----- NCO2INCU Bits -----------------------------------------------------
INC0             EQU  H'0000'
INC1             EQU  H'0001'
INC2             EQU  H'0002'
INC3             EQU  H'0003'
NCO2INC16        EQU  H'0000'
NCO2INC17        EQU  H'0001'
NCO2INC18        EQU  H'0002'
NCO2INC19        EQU  H'0003'
INC16            EQU  H'0000'
INC17            EQU  H'0001'
INC18            EQU  H'0002'
INC19            EQU  H'0003'
NCO2INC0         EQU  H'0000'
NCO2INC1         EQU  H'0001'
NCO2INC2         EQU  H'0002'
NCO2INC3         EQU  H'0003'


;----- NCO2CON Bits -----------------------------------------------------
PFM              EQU  H'0000'
POL_NCO2CON      EQU  H'0004'
OUT_NCO2CON      EQU  H'0005'
EN               EQU  H'0007'
NCO2PFM          EQU  H'0000'
NCO2POL          EQU  H'0004'
NCO2OUT          EQU  H'0005'
NCO2EN           EQU  H'0007'


;----- NCO2CLK Bits -----------------------------------------------------
CKS0             EQU  H'0000'
CKS1             EQU  H'0001'
CKS2             EQU  H'0002'
CKS3             EQU  H'0003'
PWS0             EQU  H'0005'
PWS1             EQU  H'0006'
PWS2             EQU  H'0007'
CKS0             EQU  H'0000'
CKS1             EQU  H'0001'
CKS2             EQU  H'0002'
CKS3             EQU  H'0003'
PWS0             EQU  H'0005'
PWS1             EQU  H'0006'
PWS2             EQU  H'0007'
NCO2CKS0         EQU  H'0000'
NCO2CKS1         EQU  H'0001'
NCO2CKS2         EQU  H'0002'
NCO2CKS3         EQU  H'0003'
NCO2PWS0         EQU  H'0005'
NCO2PWS1         EQU  H'0006'
NCO2PWS2         EQU  H'0007'
NCO2CKS0         EQU  H'0000'
NCO2CKS1         EQU  H'0001'
NCO2CKS2         EQU  H'0002'
NCO2CKS3         EQU  H'0003'
NCO2PWS0         EQU  H'0005'
NCO2PWS1         EQU  H'0006'
NCO2PWS2         EQU  H'0007'


